import styled from "@emotion/styled";
import ReactMarkdown from "react-markdown";

export default function Privacy() {
  return (
    <Wrapper>
      <ReactMarkdown>{`
# プライバシーポリシー

株式会社ライオット(以下「当社」という)は、当社の提供するサービスの利用者(以下「ユーザー」という)に関する個人情報を含んだ情報(以下「ユーザー情報」という)の取扱いについて、以下のとおりプライバシーポリシー(以下「本ポリシー」という)を定めます。

## 取得する情報およびその取得方法

当社が取得するユーザー情報は、その取得方法に応じて、以下のとおりとなります。

- 氏名
- 生年月日
- 性別
- メールアドレス
- 電話話番号
- 住所
- Cookie(クッキー)を用いて生成された識別情報
- OS が生成する ID、端末の種類、端末識別子等のお客様が利用するOSや端末に関する情報 
- 当社ウェブサイトの滞在時間、入力履歴、購買履歴等の当社ウェブサイトにおけるユーザーの行動履歴
- 当社アプリの起動時間、入力履歴、購買履歴等の当社アプリの利用履歴
- ユーザーのスキルシート

## 技術情報の取得

ユーザーが本サービスにアクセスする際に、当社は以下の技術情報を取得します。

- 端末の種類
- 端末識別子
- ブラウザの種類
- リファラ
- IP アドレス
- Cookie
- その他広告識別子

## ユーザーの個別同意に基づいて取得する情報

当社はユーザーから個別の同意を得られた場合、以下の情報を取得します。

- 位置情報
- 電話帳

## 利用目的

当社は、取得したユーザー情報を以下に定める目的のために使用します。

- 当社サービスに関する登録の受付、本人確認、認証のため
- 当社サービスの利用履歴を管理するため
- 利用料金の決済のため
- 当社サービスにおける行動履歴を分析し、当社サービスの維持改善に役立てるため
- 広告の配信、表示及び効果測定のため
- ユーザーの趣味嗜好にあわせたターゲティング広告を表示するため
- 当社のサービスに関するご案内をするため
- 提携する事業者
- サービスのご案内をお送りするため
- お問い合わせに対応するため
- 当社の規約や法令に違反する行為に対応するため
- 当社サービスの変更、提供中止、終了、契約解除をご連絡するため
- 当社規約の変更等を通知するため
- 以上の他、当社サービスの提供、維持、保護及び改善のため

## 個人情報の第三者提供

当社は、ユーザー情報のうち個人情報に関して、あらかじめユーザーの同意を得ることなく、第 三者に提供しません。但し、次に定める場合にはこの限りではなく、ユーザー情報を第三者に提供することがあります。

- 外部サービスとの連携または、外部サービスを利用した認証にあたり、当該外部サービス
  運営会社にユーザー情報を提供する場合
- 国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して、当社が協力する必要があり、かつユーザーからの同意取得が当該事務の遂行に支障を及ぼすおそれがある場合
- 事業パートナーと共同利用する場合(具体的な共同利用がある場合は、その内容を別途公表します。)
- その他法令で認められる場合

## 個人情報の開示

当社は、ユーザーから、個人情報保護法の定めに基づき個人情報の開示を求められたときは、ユ ーザーご本人からのご請求であることを確認のうえで、ユーザーに対し、遅滞なく開示を行いま す。但し、個人情報保護法その他の法令により、当社が開示の義務を負わない場合は、この限りではありません。

## 個人情報の訂正および利用の停止等

- 当社は、ユーザーから、個人情報の内容が事実ではなく、訂正・追加・削除(以下「訂正 等」という)を求められたときは、ユーザーご本人からのご請求であることを確認のうえ遅滞なく調査を行い、その結果に基づき、個人情報の内容の訂正等を行い、その旨をユーザーに通知します。
- 当社は、ユーザーから、以下の各号の理由に基づき個人情報の利用の停止または消去(以下「利用の停止等」という)を求められたときは、ユーザーご本人からのご請求であることを 確認のうえ遅滞なく調査を行い、その結果に基づき、個人情報の利用の停止等を行い、その旨をユーザーに通知します。
  - あらかじめ公表された利用目的の範囲を超えて個人情報が取扱われているという理由
  - 偽りその他の手段により個人情報が取得されたものであるという理由
- 個人情報保護法その他の法令により、当社が訂正等または利用の停止等の義務を負わない場合、本条 1 項、2 項の定めは適用されません。

## お問い合わせ

当社のプライバシーポリシーに関する、ご意見、ご質問、苦情の申出その他ユーザー情報の取扱 いに関するお問い合わせは、以下の窓口にご連絡ください。

e-mail:info@riot-company.com

## 改定

当社は、当社の裁量に基づいて、本ポリシーを変更します。但し、個人情報保護法その他の法令により、改定に必要な手続が定められている場合には、当該法令に基づき改定を行うものとします。なお、当社は、ユーザーに対して本ポリシーを変更する場合には、変更後の本ポリシーの施行時期および内容を以下の方法で周知します。

- 当社のウェブサイトへの掲示
- ユーザーへの通知
- その他適切な方法

## 事業者の名称

株式会社ライオット

## 代表者氏名

下野 隼

## 事業者の住所

東京都渋谷区広尾 2 丁目 13 番 6 号

2023 年 10 月 12 日 制定

    `}</ReactMarkdown>
    </Wrapper>
  );
}

const Wrapper = styled.div`
  * {
    all: revert;
  }
  padding: 16px;
`;
